In [8]:
import pandas as pd

In [9]:
df = pd.read_csv("/Users/rawan/Downloads/Products_data (1).csv")
df.head()

,Unnamed: 0,prod_id,product_type,product_name,warehouses,price,profit_margin (%),capacity
0,0,911,M,WWW,"[5498, 6164, 5623, 7418, 8962, 7721, 4208, 871...",3088.68,24,"[273046, 237295, 204228, 363846, 490896, 85155..."
1,1,316,F,MMM,"[3865, 5351]",107.39,47,"[219660, 399034]"
2,2,549,P,LLL,[1969],47.14,7,[162211]
3,3,801,V,SSS,"[3613, 4412, 2730, 1482, 2430, 7465, 8954, 118...",13.62,6,"[276213, 146456, 91011, 503654, 186945, 79444,..."
4,4,791,R,AAA,"[3514, 9292, 9388, 6379, 1149, 1526, 6928, 1888]",6.35,7,"[209208, 28830, 300112, 696414, 65930, 45429, ..."

In [10]:
df = df.drop(['Unnamed: 0','capacity'],'columns')

/var/folders/g6/6kqv9qpn6h36qmydh9bmydyc0000gn/T/ipykernel_23642/925163129.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df = df.drop(['Unnamed: 0','capacity'],'columns')

In [11]:
df.head()

,prod_id,product_type,product_name,warehouses,price,profit_margin (%)
0,911,M,WWW,"[5498, 6164, 5623, 7418, 8962, 7721, 4208, 871...",3088.68,24
1,316,F,MMM,"[3865, 5351]",107.39,47
2,549,P,LLL,[1969],47.14,7
3,801,V,SSS,"[3613, 4412, 2730, 1482, 2430, 7465, 8954, 118...",13.62,6
4,791,R,AAA,"[3514, 9292, 9388, 6379, 1149, 1526, 6928, 1888]",6.35,7

In [12]:
df.to_csv("DataSet/Products_data.csv",index=False)